Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: ألم تر أن الله يزجي سحابا ثم يؤلف بينه ثم يجعله ركاما فترى الودق يخرج من خلاله وينزل من السماء من جبال فيها من برد فيصيب به من يشاء ويصرفه عن من يشاء يكاد سنا برقه يذهب بالأبصار
en: Do you not see that Allah drives clouds? Then He brings them together, then He makes them into a mass, and you see the rain emerge from within it. And He sends down from the sky, mountains [of clouds] within which is hail, and He strikes with it whom He wills and averts it from whom He wills. The flash of its lightening almost takes away the eyesight.

source: يقلب الله الليل والنهار إن في ذلك لعبرة لأولي الأبصار
en: Allah alternates the night and the day. Indeed in that is a lesson for those who have vision.

source: والله خلق كل دابة من ماء فمنهم من يمشي على بطنه ومنهم من يمشي على رجلين ومنهم من يمشي على أربع يخلق الله ما يشاء إن الله على كل شيء قدير
en: Allah has created every [living] creature from water. And of them are those that move on their bellies, and of them are those that walk on two legs, and of them are those that walk on four. Allah creates what He wills. Indeed, Allah is over all things competent.

source: لقد أنزلنا آيات مبينات والله يهدي من يشاء إلى صراط مستقيم
en: We have certainly sent down distinct verses. And Allah guides whom He wills to a straight path.

source: ويقولون آمنا بالله وبالرسول وأطعنا ثم يتولى فريق منهم من بعد ذلك وما أولئك بالمؤمنين
en: But the hypocrites say, "We have believed in Allah and in the Messenger, and we obey"; then a party of them turns away after that. And those are not believers.

source: وإذا دعوا إلى الله ورسوله ليحكم بينهم إذا فريق منهم معرضون
en: And when they are called to [the words of] Allah and His Messenger to judge between them, at once a party of them turns aside [in refusal].

source: وإن يكن لهم الحق يأتوا إليه مذعنين
en: But if the right is theirs, they come to him in prompt obedience.

source: أفي قلوبهم مرض أم ارتابوا أم يخافون أن يحيف الله عليهم ورسوله بل أولئك هم الظالمون
en: Is there disease in their hearts? Or have they doubted? Or do they fear that Allah will be unjust to them, or His Messenger? Rather, it is they who are the wrongdoers.

source: إنما كان قول المؤمنين إذا دعوا إلى الله ورسوله ليحكم بينهم أن يقولوا سمعنا وأطعنا وأولئك هم المفلحون
en: The only statement of the [true] believers when they are called to Allah and His Messenger to judge between them is that they say, "We hear and we obey." And those are the successful.

source: ومن يطع الله ورسوله ويخش الله ويتقه فأولئك هم الفائزون
en: And whoever obeys Allah and His Messenger and fears Allah and is conscious of Him - it is those who are the attainers.

source: وأقسموا بالله جهد أيمانهم لئن أمرتهم ليخرجن قل لا تقسموا طاعة معروفة إن الله خبير بما تعملون
en: And they swear by Allah their strongest oaths that if you ordered them, they would go forth [in Allah 's cause]. Say, "Do not swear. [Such] obedience is known. Indeed, Allah is Acquainted with that which you do."

source: قل أطيعوا الله وأطيعوا الرسول فإن تولوا فإنما عليه ما حمل وعليكم ما حملتم وإن تطيعوه تهتدوا وما على الرسول إلا البلاغ المبين
en: Say, "Obey Allah and obey the Messenger; but if you turn away - then upon him is only that [duty] with which he has been charged, and upon you is that with which you have been charged. And if you obey him, you will be [rightly] guided. And there is not upon the Messenger except the [responsibility for] clear notification."

source: وعد الله الذين آمنوا منكم وعملوا الصالحات ليستخلفنهم في الأرض كما استخلف الذين من قبلهم وليمكنن لهم دينهم الذي ارتضى لهم وليبدلنهم من بعد خوفهم أمنا يعبدونني لا يشركون بي شيئا ومن كفر بعد ذلك فأولئك هم الفاسقون
en: Allah has promised those who have believed among you and done righteous deeds that He will surely grant them succession [to authority] upon the earth just as He granted it to those before them and that He will surely establish for them [therein] their religion which He has preferred for them and that He will surely substitute for them, after their fear, security, [for] they worship Me, not associating anything with Me. But whoever disbelieves after that - then those are the defiantly disobedient.

source: وأقيموا الصلاة وآتوا الزكاة وأطيعوا الرسول لعلكم ترحمون
en: And establish prayer and give zakah and obey the Messenger - that you may receive mercy.

source: لا تحسبن الذين كفروا معجزين في الأرض ومأواهم النار ولبئس المصير
en: Never think that the disbelievers are causing failure [to Allah] upon the earth. Their refuge will be the Fire - and how wretched the destination.

source: يا أيها الذين آمنوا ليستأذنكم الذين ملكت أيمانكم والذين لم يبلغوا الحلم منكم ثلاث مرات من قبل صلاة الفجر وحين تضعون ثيابكم من الظهيرة ومن بعد صلاة العشاء ثلاث عورات لكم ليس عليكم ولا عليهم جناح بعدهن طوافون عليكم بعضكم على بعض كذلك يبين الله لكم الآيات والله عليم حكيم
en: O you who have believed, let those whom your right hands possess and those who have not [yet] reached puberty among you ask permission of you [before entering] at three times: before the dawn prayer and when you put aside your clothing [for rest] at noon and after the night prayer. [These are] three times of privacy for you. There is no blame upon you nor upon them beyond these [periods], for they continually circulate among you - some of you, among others. Thus does Allah make clear to you the verses; and Allah is Knowing and Wise.

source: وإذا بلغ الأطفال منكم الحلم فليستأذنوا كما استأذن الذين من قبلهم كذلك يبين الله لكم آياته والله عليم حكيم
en: And when the children among you reach puberty, let them ask permission [at all times] as those before them have done. Thus does Allah make clear to you His verses; and Allah is Knowing and Wise.

source: والقواعد من النساء اللاتي لا يرجون نكاحا فليس عليهن جناح أن يضعن ثيابهن غير متبرجات بزينة وأن يستعففن خير لهن والله سميع عليم
en: And women of post-menstrual age who have no desire for marriage - there is no blame upon them for putting aside their outer garments [but] not displaying adornment. But to modestly refrain [from that] is better for them. And Allah is Hearing and Knowing.

source: ليس على الأعمى حرج ولا على الأعرج حرج ولا على المريض حرج ولا على أنفسكم أن تأكلوا من بيوتكم أو بيوت آبائكم أو بيوت أمهاتكم أو بيوت إخوانكم أو بيوت أخواتكم أو بيوت أعمامكم أو بيوت عماتكم أو بيوت أخوالكم أو بيوت خالاتكم أو ما ملكتم مفاتحه أو صديقكم ليس عليكم جناح أن تأكلوا جميعا أو أشتاتا فإذا دخلتم بيوتا فسلموا على أنفسكم تحية من عند الله مباركة طيبة كذلك يبين الله لكم الآيات لعلكم تعقلون
en: There is not upon the blind [any] constraint nor upon the lame constraint nor upon the ill constraint nor upon yourselves when you eat from your [own] houses or the houses of your fathers or the houses of your mothers or the houses of your brothers or the houses of your sisters or the houses of your father's brothers or the houses of your father's sisters or the houses of your mother's brothers or the houses of your mother's sisters or [from houses] whose keys you possess or [from the house] of your friend. There is no blame upon you whether you eat together or separately. But when you enter houses, give greetings of peace upon each other - a greeting from Allah, blessed and good. Thus does Allah make clear to you the verses [of ordinance] that you may understand.

source: إنما المؤمنون الذين آمنوا بالله ورسوله وإذا كانوا معه على أمر جامع لم يذهبوا حتى يستأذنوه إن الذين يستأذنونك أولئك الذين يؤمنون بالله ورسوله فإذا استأذنوك لبعض شأنهم فأذن لمن شئت منهم واستغفر لهم الله إن الله غفور رحيم
en: The believers are only those who believe in Allah and His Messenger and, when they are [meeting] with him for a matter of common interest, do not depart until they have asked his permission. Indeed, those who ask your permission, [O Muhammad] - those are the ones who believe in Allah and His Messenger. So when they ask your permission for something of their affairs, then give permission to whom you will among them and ask forgiveness for them of Allah. Indeed, Allah is Forgiving and Merciful.

source: لا تجعلوا دعاء الرسول بينكم كدعاء بعضكم بعضا قد يعلم الله الذين يتسللون منكم لواذا فليحذر الذين يخالفون عن أمره أن تصيبهم فتنة أو يصيبهم عذاب أليم
en: Do not make [your] calling of the Messenger among yourselves as the call of one of you to another. Already Allah knows those of you who slip away, concealed by others. So let those beware who dissent from the Prophet's order, lest fitnah strike them or a painful punishment.

source: ألا إن لله ما في السماوات والأرض قد يعلم ما أنتم عليه ويوم يرجعون إليه فينبئهم بما عملوا والله بكل شيء عليم
en: Unquestionably, to Allah belongs whatever is in the heavens and earth. Already He knows that upon which you [stand] and [knows] the Day when they will be returned to Him and He will inform them of what they have done. And Allah is Knowing of all things.

source: تبارك الذي نزل الفرقان على عبده ليكون للعالمين نذيرا
en: Blessed is He who sent down the Criterion upon His Servant that he may be to the worlds a warner -

source: الذي له ملك السماوات والأرض ولم يتخذ ولدا ولم يكن له شريك في الملك وخلق كل شيء فقدره تقديرا
en: He to whom belongs the dominion of the heavens and the earth and who has not taken a son and has not had a partner in dominion and has created each thing and determined it with [precise] determination.

source: واتخذوا من دونه آلهة لا يخلقون شيئا وهم يخلقون ولا يملكون لأنفسهم ضرا ولا نفعا ولا يملكون موتا ولا حياة ولا نشورا
en: But they have taken besides Him gods which create nothing, while they are created, and possess not for themselves any harm or benefit and possess not [power to cause] death or life or resurrection.

source: وقال الذين كفروا إن هذا إلا إفك افتراه وأعانه عليه قوم آخرون فقد جاءوا ظلما وزورا
en: And those who disbelieve say, "This [Qur'an] is not except a falsehood he invented, and another people assisted him in it." But they have committed an injustice and a lie.

source: وقالوا أساطير الأولين اكتتبها فهي تملى عليه بكرة وأصيلا
en: And they say, "Legends of the former peoples which he has written down, and they are dictated to him morning and afternoon."

source: قل أنزله الذي يعلم السر في السماوات والأرض إنه كان غفورا رحيما
en: Say, [O Muhammad], "It has been revealed by He who knows [every] secret within the heavens and the earth. Indeed, He is ever Forgiving and Merciful."

source: وقالوا مال هذا الرسول يأكل الطعام ويمشي في الأسواق لولا أنزل إليه ملك فيكون معه نذيرا
en: And they say, "What is this messenger that eats food and walks in the markets? Why was there not sent down to him an angel so he would be with him a warner?

source: أو يلقى إليه كنز أو تكون له جنة يأكل منها وقال الظالمون إن تتبعون إلا رجلا مسحورا
en: Or [why is not] a treasure presented to him [from heaven], or does he [not] have a garden from which he eats?" And the wrongdoers say, "You follow not but a man affected by magic."

source: تبارك الذي إن شاء جعل لك خيرا من ذلك جنات تجري من تحتها الأنهار ويجعل لك قصورا
en: Blessed is He who, if He willed, could have made for you [something] better than that - gardens beneath which rivers flow - and could make for you palaces.

source: بل كذبوا بالساعة وأعتدنا لمن كذب بالساعة سعيرا
en: But they have denied the Hour, and We have prepared for those who deny the Hour a Blaze.

source: إذا رأتهم من مكان بعيد سمعوا لها تغيظا وزفيرا
en: When the Hellfire sees them from a distant place, they will hear its fury and roaring.

source: وإذا ألقوا منها مكانا ضيقا مقرنين دعوا هنالك ثبورا
en: And when they are thrown into a narrow place therein bound in chains, they will cry out thereupon for destruction.

source: لا تدعوا اليوم ثبورا واحدا وادعوا ثبورا كثيرا
en: [They will be told], "Do not cry this Day for one destruction but cry for much destruction."

source: قل أذلك خير أم جنة الخلد التي وعد المتقون كانت لهم جزاء ومصيرا
en: Say, "Is that better or the Garden of Eternity which is promised to the righteous? It will be for them a reward and destination.

source: لهم فيها ما يشاءون خالدين كان على ربك وعدا مسئولا
en: For them therein is whatever they wish, [while] abiding eternally. It is ever upon your Lord a promise [worthy to be] requested.

source: ويوم يحشرهم وما يعبدون من دون الله فيقول أأنتم أضللتم عبادي هؤلاء أم هم ضلوا السبيل
en: And [mention] the Day He will gather them and that which they worship besides Allah and will say, "Did you mislead these, My servants, or did they [themselves] stray from the way?"

source: قالوا سبحانك ما كان ينبغي لنا أن نتخذ من دونك من أولياء ولكن متعتهم وآباءهم حتى نسوا الذكر وكانوا قوما بورا
en: They will say, "Exalted are You! It was not for us to take besides You any allies. But You provided comforts for them and their fathers until they forgot the message and became a people ruined."

source: فقد كذبوكم بما تقولون فما تستطيعون صرفا ولا نصرا ومن يظلم منكم نذقه عذابا كبيرا
en: So they will deny you, [disbelievers], in what you say, and you cannot avert [punishment] or [find] help. And whoever commits injustice among you - We will make him taste a great punishment.

source: وما أرسلنا قبلك من المرسلين إلا إنهم ليأكلون الطعام ويمشون في الأسواق وجعلنا بعضكم لبعض فتنة أتصبرون وكان ربك بصيرا
en: And We did not send before you, [O Muhammad], any of the messengers except that they ate food and walked in the markets. And We have made some of you [people] as trial for others - will you have patience? And ever is your Lord, Seeing.

source: وقال الذين لا يرجون لقاءنا لولا أنزل علينا الملائكة أو نرى ربنا لقد استكبروا في أنفسهم وعتوا عتوا كبيرا
en: And those who do not expect the meeting with Us say, "Why were not angels sent down to us, or [why] do we [not] see our Lord?" They have certainly become arrogant within themselves and [become] insolent with great insolence.

source: يوم يرون الملائكة لا بشرى يومئذ للمجرمين ويقولون حجرا محجورا
en: The day they see the angels - no good tidings will there be that day for the criminals, and [the angels] will say, "Prevented and inaccessible."

source: وقدمنا إلى ما عملوا من عمل فجعلناه هباء منثورا
en: And We will regard what they have done of deeds and make them as dust dispersed.

source: أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا
en: The companions of Paradise, that Day, are [in] a better settlement and better resting place.

source: ويوم تشقق السماء بالغمام ونزل الملائكة تنزيلا
en: And [mention] the Day when the heaven will split open with [emerging] clouds, and the angels will be sent down in successive descent.

source: الملك يومئذ الحق للرحمن وكان يوما على الكافرين عسيرا
en: True sovereignty, that Day, is for the Most Merciful. And it will be upon the disbelievers a difficult Day.

source: ويوم يعض الظالم على يديه يقول يا ليتني اتخذت مع الرسول سبيلا
en: And the Day the wrongdoer will bite on his hands [in regret] he will say, "Oh, I wish I had taken with the Messenger a way.

source: يا ويلتى ليتني لم أتخذ فلانا خليلا
en: Oh, woe to me! I wish I had not taken that one as a friend.

source: لقد أضلني عن الذكر بعد إذ جاءني وكان الشيطان للإنسان خذولا
en: He led me away from the remembrance after it had come to me. And ever is Satan, to man, a deserter."

source: وقال الرسول يا رب إن قومي اتخذوا هذا القرآن مهجورا
en: And the Messenger has said, "O my Lord, indeed my people have taken this Qur'an as [a thing] abandoned."

source: وكذلك جعلنا لكل نبي عدوا من المجرمين وكفى بربك هاديا ونصيرا
en: And thus have We made for every prophet an enemy from among the criminals. But sufficient is your Lord as a guide and a helper.

source: وقال الذين كفروا لولا نزل عليه القرآن جملة واحدة كذلك لنثبت به فؤادك ورتلناه ترتيلا
en: And those who disbelieve say, "Why was the Qur'an not revealed to him all at once?" Thus [it is] that We may strengthen thereby your heart. And We have spaced it distinctly.

source: ولا يأتونك بمثل إلا جئناك بالحق وأحسن تفسيرا
en: And they do not come to you with an argument except that We bring you the truth and the best explanation.

source: الذين يحشرون على وجوههم إلى جهنم أولئك شر مكانا وأضل سبيلا
en: The ones who are gathered on their faces to Hell - those are the worst in position and farthest astray in [their] way.

source: ولقد آتينا موسى الكتاب وجعلنا معه أخاه هارون وزيرا
en: And We had certainly given Moses the Scripture and appointed with him his brother Aaron as an assistant.

source: فقلنا اذهبا إلى القوم الذين كذبوا بآياتنا فدمرناهم تدميرا
en: And We said, "Go both of you to the people who have denied Our signs." Then We destroyed them with [complete] destruction.

source: وقوم نوح لما كذبوا الرسل أغرقناهم وجعلناهم للناس آية وأعتدنا للظالمين عذابا أليما
en: And the people of Noah - when they denied the messengers, We drowned them, and We made them for mankind a sign. And We have prepared for the wrongdoers a painful punishment.

source: وعادا وثمود وأصحاب الرس وقرونا بين ذلك كثيرا
en: And [We destroyed] 'Aad and Thamud and the companions of the well and many generations between them.

source: وكلا ضربنا له الأمثال وكلا تبرنا تتبيرا
en: And for each We presented examples [as warnings], and each We destroyed with [total] destruction.

source: ولقد أتوا على القرية التي أمطرت مطر السوء أفلم يكونوا يرونها بل كانوا لا يرجون نشورا
en: And they have already come upon the town which was showered with a rain of evil. So have they not seen it? But they are not expecting resurrection.

source: وإذا رأوك إن يتخذونك إلا هزوا أهذا الذي بعث الله رسولا
en: And when they see you, [O Muhammad], they take you not except in ridicule, [saying], "Is this the one whom Allah has sent as a messenger?

source: إن كاد ليضلنا عن آلهتنا لولا أن صبرنا عليها وسوف يعلمون حين يرون العذاب من أضل سبيلا
en: He almost would have misled us from our gods had we not been steadfast in [worship of] them." But they are going to know, when they see the punishment, who is farthest astray in [his] way.

source: أرأيت من اتخذ إلهه هواه أفأنت تكون عليه وكيلا
en: Have you seen the one who takes as his god his own desire? Then would you be responsible for him?

source: أم تحسب أن أكثرهم يسمعون أو يعقلون إن هم إلا كالأنعام بل هم أضل سبيلا
en: Or do you think that most of them hear or reason? They are not except like livestock. Rather, they are [even] more astray in [their] way.

source: ألم تر إلى ربك كيف مد الظل ولو شاء لجعله ساكنا ثم جعلنا الشمس عليه دليلا
en: Have you not considered your Lord - how He extends the shadow, and if He willed, He could have made it stationary? Then We made the sun for it an indication.

source: ثم قبضناه إلينا قبضا يسيرا
en: Then We hold it in hand for a brief grasp.

source: وهو الذي جعل لكم الليل لباسا والنوم سباتا وجعل النهار نشورا
en: And it is He who has made the night for you as clothing and sleep [a means for] rest and has made the day a resurrection.

source: وهو الذي أرسل الرياح بشرا بين يدي رحمته وأنزلنا من السماء ماء طهورا
en: And it is He who sends the winds as good tidings before His mercy, and We send down from the sky pure water

source: لنحيي به بلدة ميتا ونسقيه مما خلقنا أنعاما وأناسي كثيرا
en: That We may bring to life thereby a dead land and give it as drink to those We created of numerous livestock and men.

source: ولقد صرفناه بينهم ليذكروا فأبى أكثر الناس إلا كفورا
en: And We have certainly distributed it among them that they might be reminded, but most of the people refuse except disbelief.

source: ولو شئنا لبعثنا في كل قرية نذيرا
en: And if We had willed, We could have sent into every city a warner.

source: فلا تطع الكافرين وجاهدهم به جهادا كبيرا
en: So do not obey the disbelievers, and strive against them with the Qur'an a great striving.

source: وهو الذي مرج البحرين هذا عذب فرات وهذا ملح أجاج وجعل بينهما برزخا وحجرا محجورا
en: And it is He who has released [simultaneously] the two seas, one fresh and sweet and one salty and bitter, and He placed between them a barrier and prohibiting partition.

source: وهو الذي خلق من الماء بشرا فجعله نسبا وصهرا وكان ربك قديرا
en: And it is He who has created from water a human being and made him [a relative by] lineage and marriage. And ever is your Lord competent [concerning creation].

source: ويعبدون من دون الله ما لا ينفعهم ولا يضرهم وكان الكافر على ربه ظهيرا
en: But they worship rather than Allah that which does not benefit them or harm them, and the disbeliever is ever, against his Lord, an assistant [to Satan].

source: وما أرسلناك إلا مبشرا ونذيرا
en: And We have not sent you, [O Muhammad], except as a bringer of good tidings and a warner.

source: قل ما أسألكم عليه من أجر إلا من شاء أن يتخذ إلى ربه سبيلا
en: Say, "I do not ask of you for it any payment - only that whoever wills might take to his Lord a way."

source: وتوكل على الحي الذي لا يموت وسبح بحمده وكفى به بذنوب عباده خبيرا
en: And rely upon the Ever-Living who does not die, and exalt [Allah] with His praise. And sufficient is He to be, with the sins of His servants, Acquainted -

source: الذي خلق السماوات والأرض وما بينهما في ستة أيام ثم استوى على العرش الرحمن فاسأل به خبيرا
en: He who created the heavens and the earth and what is between them in six days and then established Himself above the Throne - the Most Merciful, so ask about Him one well informed.

source: وإذا قيل لهم اسجدوا للرحمن قالوا وما الرحمن أنسجد لما تأمرنا وزادهم نفورا
en: And when it is said to them, "Prostrate to the Most Merciful," they say, "And what is the Most Merciful? Should we prostrate to that which you order us?" And it increases them in aversion.

source: تبارك الذي جعل في السماء بروجا وجعل فيها سراجا وقمرا منيرا
en: Blessed is He who has placed in the sky great stars and placed therein a [burning] lamp and luminous moon.

source: وهو الذي جعل الليل والنهار خلفة لمن أراد أن يذكر أو أراد شكورا
en: And it is He who has made the night and the day in succession for whoever desires to remember or desires gratitude.

source: وعباد الرحمن الذين يمشون على الأرض هونا وإذا خاطبهم الجاهلون قالوا سلاما
en: And the servants of the Most Merciful are those who walk upon the earth easily, and when the ignorant address them [harshly], they say [words of] peace,

source: والذين يبيتون لربهم سجدا وقياما
en: And those who spend [part of] the night to their Lord prostrating and standing [in prayer]

source: والذين يقولون ربنا اصرف عنا عذاب جهنم إن عذابها كان غراما
en: And those who say, "Our Lord, avert from us the punishment of Hell. Indeed, its punishment is ever adhering;

source: إنها ساءت مستقرا ومقاما
en: Indeed, it is evil as a settlement and residence."

source: والذين إذا أنفقوا لم يسرفوا ولم يقتروا وكان بين ذلك قواما
en: And [they are] those who, when they spend, do so not excessively or sparingly but are ever, between that, [justly] moderate

source: والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما
en: And those who do not invoke with Allah another deity or kill the soul which Allah has forbidden [to be killed], except by right, and do not commit unlawful sexual intercourse. And whoever should do that will meet a penalty.

source: يضاعف له العذاب يوم القيامة ويخلد فيه مهانا
en: Multiplied for him is the punishment on the Day of Resurrection, and he will abide therein humiliated -

source: إلا من تاب وآمن وعمل عملا صالحا فأولئك يبدل الله سيئاتهم حسنات وكان الله غفورا رحيما
en: Except for those who repent, believe and do righteous work. For them Allah will replace their evil deeds with good. And ever is Allah Forgiving and Merciful.

source: ومن تاب وعمل صالحا فإنه يتوب إلى الله متابا
en: And he who repents and does righteousness does indeed turn to Allah with [accepted] repentance.

source: والذين لا يشهدون الزور وإذا مروا باللغو مروا كراما
en: And [they are] those who do not testify to falsehood, and when they pass near ill speech, they pass by with dignity.

source: والذين إذا ذكروا بآيات ربهم لم يخروا عليها صما وعميانا
en: And those who, when reminded of the verses of their Lord, do not fall upon them deaf and blind.
